{
    "how-to-begin_key1": "नाम: कैसे शुरू करें?\n",
    "how-to-begin_key2": "# इस कोर्स को कैसे शुरू करें?\n\n\n",
    "how-to-begin_key3": "'python' का उपयोग कैसे करें? समझने के लिए कृपया यह वीडियो देखें।\n@[यूट्यूब](ccPrUbz1oto)\n",
    "how-to-begin_key4": "जब आप इस पाठ्यक्रम में आगे बढ़ेंगे, तो आपको `python` कोड के उदाहरण अलग-अलग तरीकों से मिलेंगे। आपको इन उदाहरणों को **`python` शेल** पर चलाना होगा।\n",
    "how-to-begin_key5": "अपने लैपटॉप में **`python` खोल** खोलें।\n",
    "how-to-begin_key6": "ऊपर दिए गए कोड का चयन करें, Ctrl + C को एक साथ दबाएं ताकि कोड कॉपी हो जाए और फिर आप टर्मिनल पर जाकर इस कोड को टर्मिनल पर Ctrl + Shift + V दबाकर पेस्ट कर सकते हैं।\n",
    "how-to-begin_key7": "यदि आप इस कोड लाइन को लाइन से चलाएंगे, तो आप कोड लाइन को लाइन से समझ पाएंगे।\n",
    "how-to-begin_key8": "यह पूरा कोड 4-5 अलग-अलग कार्य कर रहा है, हम इस कोड को भागों में कैसे तोड़ सकते हैं और समझ सकते हैं, यह विधि नीचे दी गई है और यह भविष्य में आपकी मदद करने वाली है।\n",
    "how-to-begin_key9": "यह पहली लाइन है, इस लाइन को टर्मिनल पर चलाएं, आप टर्मिनल पर कुछ देख पाएंगे।\n",
    "how-to-begin_key10": "कृपया इस दूसरे कोड को टर्मिनल पर चलाएं और देखें कि वहां क्या होता है?\n",
    "how-to-begin_key11": "अब इस लाइन को अलग से टर्मिनल पर चलाएं और देखें कि वहां क्या होता है?\n",
    "how-to-begin_key12": "अब इस कोड को एक साथ टर्मिनल पर कॉपी पेस्ट करें और देखें कि वहां क्या होता है?\n",
    "how-to-begin_key13": "इस लाइन में क्या हो रहा है, आप बाद में समझ पाएंगे? लेकिन इस कोड को चलाएँ और समझने की कोशिश करें।\n",
    "how-to-begin_key14": "इसे टर्मिनल पर कॉपी पेस्ट करें और इसे रोकने के लिए टर्मिनल पर एक साथ Ctrl + C दबाएं।\n",
    "how-to-begin_key15": "अब इस कोड को रन करें और ऊपर और नीचे दिए गए कोड के बीच अंतर को पहचानने की कोशिश करें।\n",
    "how-to-begin_key16": "अब इस कोड को एक साथ रन करें और इस कोड को रोकने के लिए आप क्या करेंगे?\n",
    "how-to-begin_key17": "अब सोचिये कि ऊपर दिए गए कोड को रोकने के लिए आप क्या करेंगे?\n",
    "how-to-begin_key18": "इसी तरह इस तरह पूरे कोर्स में सिर्फ कोड ही लिखे जाएंगे। आपको केवल इस तरह से कोड चलाने की आवश्यकता होगी। इस कोड को चलाने के लिए आपको अपने लैपटॉप पर टर्मिनल नाम का एक एप्लिकेशन खोलना होगा। इसे खोलने के बाद, आपको `python` कोड टाइप करना होगा और फिर इसे चलाना होगा।\n",
    "how-to-begin_key19": "## बहुत महत्वपूर्ण नियम\n\n",
    "how-to-begin_key20": "प्रत्येक उदाहरण को **`python` शेल** पर निष्पादित करें। अगर आप ऐसा नहीं कर रहे हैं तो आप खुद को बेवकूफ बना रहे हैं।\n",
    "how-to-begin_key21": "कोड को कॉपी-पेस्ट करने से आप ठीक से समझ नहीं पाएंगे। आपको प्रत्येक कोड स्वयं लिखना चाहिए और फिर उसे चलाना चाहिए।\n",
    "how-to-begin_key22": "UPPER CASE या **बोल्ड लेटर्स** में लिखे गए शब्द बहुत महत्वपूर्ण हैं। उन्हें जानें, आप उनसे कई बार मिलेंगे।\n",
    "how-to-begin_key23": "कोर्स के दौरान आपको कई जगहों पर कुछ सवालों के जवाब देने होते हैं। उत्तर देने के लिए आप फ़ाइल अपलोड कर सकते हैं।\n"
}